# Books Assignment
- Juliana Sahagun

![png](books_erd1.png)

In [55]:
# Imports
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

In [56]:
# Create connection with engine
connection = "mysql+pymysql://root:root@localhost/books"
engine = create_engine(connection)

In [57]:
# Check if database exists, if not, create it
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

In [58]:
# Create dataframe for authors
df = pd.read_csv('data/authors.csv')
df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [59]:
df.to_sql('authors', engine, if_exists= 'replace')

5

In [60]:
q = """
SELECT * 
FROM authors
LIMIT 5;
"""

pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [61]:
# Create dataframe for books
df = pd.read_csv('data/books.csv')
df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [62]:
df.to_sql('books', engine, if_exists= 'replace')

6

In [63]:
q ="""
SELECT * 
FROM books
LIMIT 5;
"""

pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4

In [64]:
# Create dataframe for favorites
df = pd.read_csv('data/favorites.csv')
df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [65]:
df.to_sql('favorites', engine, if_exists= 'replace')

7

In [66]:
q ="""
SELECT * 
FROM favorites
LIMIT 5;
"""

pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

In [67]:
# Create dataframe for users
df=pd.read_csv('data/users.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [68]:
df.to_sql('users', engine, if_exists= 'replace')

3

In [70]:
q ="""
SELECT * 
FROM users
LIMIT 5;
"""

pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [74]:
# Test the database
q= """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1